# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Simon\Documents\GitHub\E3PRJ3-Gruppe1\PSoC\Sensor-PSoC.cydsn\Sensor-PSoC.cyprj
# Date: Thu, 19 May 2016 08:22:30 GMT
#set_units -time ns
create_clock -name {I2CS_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {LumenCom_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {timer_clock(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_8}] [get_pins {ClockBlock/ff_div_9}] [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {I2CS_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 31} [list]
create_generated_clock -name {LumenCom_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 31} [list]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {metronome_clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 120001 240001} [list [get_pins {ClockBlock/udb_div_3}]]


# Component constraints for C:\Users\Simon\Documents\GitHub\E3PRJ3-Gruppe1\PSoC\Sensor-PSoC.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Simon\Documents\GitHub\E3PRJ3-Gruppe1\PSoC\Sensor-PSoC.cydsn\Sensor-PSoC.cyprj
# Date: Thu, 19 May 2016 08:22:27 GMT
